In [37]:
import pandas as pd

In [2]:
import numpy as np

In [10]:
from sklearn.impute import SimpleImputer

In [38]:
df = pd.read_csv("Data.csv")

In [4]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [8]:
df.isnull().sum()

Country      1
Age          1
Salary       1
Purchased    1
dtype: int64

In [16]:
df.iloc[:,2:3]

    Salary
0  72000.0
1  48000.0
2  54000.0
3  61000.0
4  48000.0
5  58000.0
6  52000.0
7  79000.0
8  83000.0
9  67000.0

In [15]:
impute = SimpleImputer(strategy = "most_frequent")
impute.fit(df.iloc[:,2:3].values)
df.iloc[:,2:3] = impute.transform(df.iloc[:,2:3].values)
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0  48000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [48]:
df.loc[4]

Country      Germany
Age             40.0
Salary           NaN
Purchased        Yes
Name: 4, dtype: object

In [49]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value1': [1, 2, 3, 4]})

df2 = pd.DataFrame({'key': ['B', 'D', 'E', 'F'],
                    'value2': [5, 6, 7, 8]})

In [50]:
df = pd.merge(df1,df2)

In [51]:
df

  key  value1  value2
0   B       2       5
1   D       4       6

In [52]:
df = pd.join(df1,df2)

AttributeError: module 'pandas' has no attribute 'join'